outer = {
    1: 3,
    2: 5,
    3: 8,
    4: 12,
    5: 15,
    6: 8,
    7: 7,
    8: 3,
    9: 2,
    10: 10,
    11: 20,
    12: 5,
    13: 3,
    14: 19,
    15: 17,
    16: 1,
    17: 4,
    18: 18,
    19: 19,
    20: 1,
}

inner = {
    1: 13,
    2: 15,
    3: 18,
    4: 2,
    5: 7,
    6: 18,
    7: 17,
    8: 13,
    9: 12,
    10: 1,
    11: 2,
    12: 15,
    13: 13,
    14: 9,
    15: 7,
    16: 11,
    17: 14,
    18: 8,
    19: 9,
    20: 11,
}


def score(target, num=1):
    if target == "Яблочко":
        return 50

    if target == "Внешнее_кольцо":
        return print(outer[num])
    if target == "Внутреннее_кольцо":
        return print(inner[num])


score("Внутреннее_кольцо", 5)